<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"041dc1c0c4bda90181d8739888179ff85a8e8438d3c20b3c71e887b6ef158121","plan_job_ref":"Job CICD for Splitrr Infra #43 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676544799","plan_out_hash":"2841ff4b7bdf0f0eaebcf65d2ca12840183d6859876521572157dcc85586a6a3","plan_hash":"d29795faea733b217df56a383bf1bdbc0d8d7adc82cc204146e4fa1f7f2fb2fd","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 9 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb_acm.aws_acm_certificate_validation.acm_certificate_validation must be replaced
+/- resource "aws_acm_certificate_validation" "acm_certificate_validation" {
!~      id                      = "*********************************" -> (known after apply)
!~      validation_record_fqdns = [ # forces replacement
-           "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech",
-           "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech",
        ] -> (known after apply) # forces replacement
#        (1 unchanged attribute hidden)
    }

  # module.alb_acm.aws_route53_record.route53_record["api.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech"
+       records         = [
+           "_3fe0d2ad07dcba2e03cd1f7ecbcd8c9c.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.alb_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech"
+       records         = [
+           "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "CNAME"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "d2kv2y9eh8mtkp.cloudfront.net"
+           zone_id                = "**************"
        }
    }

  # module.cloudfront_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = "arn:aws:acm:us-east-1:949263681218:certificate/7dfe9968-be1c-4e61-91ca-9b0fb6b97676"
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["app.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech"
+       records         = [
+           "_b279fe69b90a7a78590cf58998c74261.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech"
+       records         = [
+           "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.ecs-ec2.data.aws_iam_policy_document.ecs_node_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_node_doc" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.ecs-ec2.aws_iam_policy.ecs_exec_policy will be created
+   resource "aws_iam_policy" "ecs_exec_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy for ECS tasks to access Secrets Manager"
+       id               = (known after apply)
+       name             = "splitrr-dev-backend-ecs-ec2-ecs-exec-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_iam_role.ecs_node_role will be updated in-place
!~  resource "aws_iam_role" "ecs_node_role" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        name                  = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_exec_role_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "splitrr-dev-backend-ecs-ec2-exec-role20240901163103904300000002"
    }

Plan: 9 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #43](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676544799)